; domain
;; source: https://github.com/AI-Planning/pddl-generators/blob/main/sokoban/domain.pddl
;; updates:
;;   - only focus on microban instances, hence 4 constant directions
;;
(define (domain sokoban)
(:requirements :typing)
(:types location direction box)

(:constants down up left right - direction)

(:predicates
             (at-robot ?l - location)
             (at ?o - box ?l - location)
             (adjacent ?l1 - location ?l2 - location ?d - direction) 
             (clear ?l - location)
)

(:action move
:parameters (?from - location ?to - location ?dir - direction)
:precondition (and (clear ?to) (at-robot ?from) (adjacent ?from ?to ?dir))
:effect (and (at-robot ?to) (not (at-robot ?from)))
)
             

(:action push
:parameters  (?rloc - location ?bloc - location ?floc - location ?dir - direction ?b - box)
:precondition (and (at-robot ?rloc) (at ?b ?bloc) (clear ?floc)
	           (adjacent ?rloc ?bloc ?dir) (adjacent ?bloc ?floc ?dir))

:effect (and (at-robot ?bloc) (at ?b ?floc) (clear ?bloc)
             (not (at-robot ?rloc)) (not (at ?b ?bloc)) (not (clear ?floc)))
)
)

; problem
;; grid_size=7, boxes=1, out_folder=training/easy, instance_id=1, seed=42
;;
;;   #  #  #  #  #  #  #
;;   #  +  +  .  .  .  #
;;   #  +  +  +  +  +  #
;;   #  G  .  # 1+ R+  #
;;   #  .  .  .  +  +  #
;;   #  .  .  .  .  .  #
;;   #  #  #  #  #  #  #
;;

(define (problem sokoban-07)
 (:domain sokoban)
 (:objects
    loc_1_1 loc_1_2 loc_1_3 loc_1_4 loc_1_5 loc_1_6 loc_1_7
    loc_2_1 loc_2_2 loc_2_3 loc_2_4 loc_2_5 loc_2_6 loc_2_7
    loc_3_1 loc_3_2 loc_3_3 loc_3_4 loc_3_5 loc_3_6 loc_3_7
    loc_4_1 loc_4_2 loc_4_3 loc_4_4 loc_4_5 loc_4_6 loc_4_7
    loc_5_1 loc_5_2 loc_5_3 loc_5_4 loc_5_5 loc_5_6 loc_5_7
    loc_6_1 loc_6_2 loc_6_3 loc_6_4 loc_6_5 loc_6_6 loc_6_7
    loc_7_1 loc_7_2 loc_7_3 loc_7_4 loc_7_5 loc_7_6 loc_7_7 - location
    box1 - box
    )
 (:init

    (at-robot loc_4_6)
    (at box1 loc_4_5)

    ;; clear locations
    (clear loc_2_2) (clear loc_2_3) (clear loc_2_4) (clear loc_2_5) (clear loc_2_6)
    (clear loc_3_2) (clear loc_3_3) (clear loc_3_4) (clear loc_3_5) (clear loc_3_6)
    (clear loc_4_2) (clear loc_4_3)                                 (clear loc_4_6)
    (clear loc_5_2) (clear loc_5_3) (clear loc_5_4) (clear loc_5_5) (clear loc_5_6)
    (clear loc_6_2) (clear loc_6_3) (clear loc_6_4) (clear loc_6_5) (clear loc_6_6)

    ;; right/left adjacencies
    (adjacent loc_2_2 loc_2_3 right)
    (adjacent loc_2_3 loc_2_4 right)
    (adjacent loc_2_4 loc_2_5 right)
    (adjacent loc_2_5 loc_2_6 right)

    (adjacent loc_3_2 loc_3_3 right)
    (adjacent loc_3_3 loc_3_4 right)
    (adjacent loc_3_4 loc_3_5 right)
    (adjacent loc_3_5 loc_3_6 right)

    (adjacent loc_4_2 loc_4_3 right)
    (adjacent loc_4_5 loc_4_6 right)

    (adjacent loc_5_2 loc_5_3 right)
    (adjacent loc_5_3 loc_5_4 right)
    (adjacent loc_5_4 loc_5_5 right)
    (adjacent loc_5_5 loc_5_6 right)

    (adjacent loc_6_2 loc_6_3 right)
    (adjacent loc_6_3 loc_6_4 right)
    (adjacent loc_6_4 loc_6_5 right)
    (adjacent loc_6_5 loc_6_6 right)

    (adjacent loc_2_3 loc_2_2 left)
    (adjacent loc_2_4 loc_2_3 left)
    (adjacent loc_2_5 loc_2_4 left)
    (adjacent loc_2_6 loc_2_5 left)

    (adjacent loc_3_3 loc_3_2 left)
    (adjacent loc_3_4 loc_3_3 left)
    (adjacent loc_3_5 loc_3_4 left)
    (adjacent loc_3_6 loc_3_5 left)

    (adjacent loc_4_3 loc_4_2 left)
    (adjacent loc_4_6 loc_4_5 left)

    (adjacent loc_5_3 loc_5_2 left)
    (adjacent loc_5_4 loc_5_3 left)
    (adjacent loc_5_5 loc_5_4 left)
    (adjacent loc_5_6 loc_5_5 left)

    (adjacent loc_6_3 loc_6_2 left)
    (adjacent loc_6_4 loc_6_3 left)
    (adjacent loc_6_5 loc_6_4 left)
    (adjacent loc_6_6 loc_6_5 left)

    ;; up/down adjacencies
    (adjacent loc_2_2 loc_3_2 down)
    (adjacent loc_3_2 loc_4_2 down)
    (adjacent loc_4_2 loc_5_2 down)
    (adjacent loc_5_2 loc_6_2 down)

    (adjacent loc_2_3 loc_3_3 down)
    (adjacent loc_3_3 loc_4_3 down)
    (adjacent loc_4_3 loc_5_3 down)
    (adjacent loc_5_3 loc_6_3 down)

    (adjacent loc_2_4 loc_3_4 down)
    (adjacent loc_5_4 loc_6_4 down)

    (adjacent loc_2_5 loc_3_5 down)
    (adjacent loc_3_5 loc_4_5 down)
    (adjacent loc_4_5 loc_5_5 down)
    (adjacent loc_5_5 loc_6_5 down)

    (adjacent loc_2_6 loc_3_6 down)
    (adjacent loc_3_6 loc_4_6 down)
    (adjacent loc_4_6 loc_5_6 down)
    (adjacent loc_5_6 loc_6_6 down)

    (adjacent loc_3_2 loc_2_2 up)
    (adjacent loc_4_2 loc_3_2 up)
    (adjacent loc_5_2 loc_4_2 up)
    (adjacent loc_6_2 loc_5_2 up)

    (adjacent loc_3_3 loc_2_3 up)
    (adjacent loc_4_3 loc_3_3 up)
    (adjacent loc_5_3 loc_4_3 up)
    (adjacent loc_6_3 loc_5_3 up)

    (adjacent loc_3_4 loc_2_4 up)
    (adjacent loc_6_4 loc_5_4 up)

    (adjacent loc_3_5 loc_2_5 up)
    (adjacent loc_4_5 loc_3_5 up)
    (adjacent loc_5_5 loc_4_5 up)
    (adjacent loc_6_5 loc_5_5 up)

    (adjacent loc_3_6 loc_2_6 up)
    (adjacent loc_4_6 loc_3_6 up)
    (adjacent loc_5_6 loc_4_6 up)
    (adjacent loc_6_6 loc_5_6 up)
 )
 (:goal  (and
    (at box1 loc_4_2))))

; plan
1. (move loc_4_6 loc_3_6 up)
   deleted: (at-robot loc_4_6)
   added: (at-robot loc_3_6)
   goals met: 0 of 1
2. (move loc_3_6 loc_3_5 left)
   deleted: (at-robot loc_3_6)
   added: (at-robot loc_3_5)
   goals met: 0 of 1
3. (push loc_3_5 loc_4_5 loc_5_5 down box1)
   deleted: (at-robot loc_3_5) (at box1 loc_4_5) (clear loc_5_5)
   added: (at-robot loc_4_5) (at box1 loc_5_5) (clear loc_4_5)
   goals met: 0 of 1
4. (move loc_4_5 loc_4_6 right)
   deleted: (at-robot loc_4_5)
   added: (at-robot loc_4_6)
   goals met: 0 of 1
5. (move loc_4_6 loc_5_6 down)
   deleted: (at-robot loc_4_6)
   added: (at-robot loc_5_6)
   goals met: 0 of 1
6. (push loc_5_6 loc_5_5 loc_5_4 left box1)
   deleted: (at-robot loc_5_6) (at box1 loc_5_5) (clear loc_5_4)
   added: (at-robot loc_5_5) (at box1 loc_5_4) (clear loc_5_5)
   goals met: 0 of 1
7. (push loc_5_5 loc_5_4 loc_5_3 left box1)
   deleted: (at-robot loc_5_5) (at box1 loc_5_4) (clear loc_5_3)
   added: (at-robot loc_5_4) (at box1 loc_5_3) (clear loc_5_4)
   goals met: 0 of 1
8. (push loc_5_4 loc_5_3 loc_5_2 left box1)
   deleted: (at-robot loc_5_4) (at box1 loc_5_3) (clear loc_5_2)
   added: (at-robot loc_5_3) (at box1 loc_5_2) (clear loc_5_3)
   goals met: 0 of 1
9. (move loc_5_3 loc_6_3 down)
   deleted: (at-robot loc_5_3)
   added: (at-robot loc_6_3)
   goals met: 0 of 1
10. (move loc_6_3 loc_6_2 left)
   deleted: (at-robot loc_6_3)
   added: (at-robot loc_6_2)
   goals met: 0 of 1
11. (push loc_6_2 loc_5_2 loc_4_2 up box1)
   deleted: (at-robot loc_6_2) (at box1 loc_5_2) (clear loc_4_2)
   added: (at-robot loc_5_2) (at box1 loc_4_2) (clear loc_5_2)
   goals met: 1 of 1
